content/posts/An_introduction_to_manifolds_by_Loring_Tu_in_2010.md
+++
title = "An introduction to manifolds by Loring Tu in 2010"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:33:44-04:00
slug = "An_introduction_to_manifolds_by_Loring_Tu_in_2010"
draft = false
+++

## 1. Euclidean spaces {#1-dot-euclidean-spaces}


### 1. Smooth functions on a Euclidean space {#1-dot-smooth-functions-on-a-euclidean-space}


### 2. Tangent vectors in \\[\mathbb{R}^n\\] as derivations {#2-dot-tangent-vectors-in-mathbb-r-n-as-derivations}


### 3. The exterior algebra of multicovectors {#3-dot-the-exterior-algebra-of-multicovectors}


### 4. Differential forms on \\[\mathbb{R}^n\\] {#4-dot-differential-forms-on-mathbb-r-n}


## 2. Manifolds {#2-dot-manifolds}


### 5. Manifolds {#5-dot-manifolds}


### 6. Smooth maps on a manifold {#6-dot-smooth-maps-on-a-manifold}


### 7. Quotients {#7-dot-quotients}


## 3. The tangent space {#3-dot-the-tangent-space}


### 8. The tangent space {#8-dot-the-tangent-space}


### 9. Submanifolds {#9-dot-submanifolds}


### 10. Categories and functors {#10-dot-categories-and-functors}


### 11. The rank of a smooth map {#11-dot-the-rank-of-a-smooth-map}


### 12. The tangent bundle {#12-dot-the-tangent-bundle}


### 13. Bump functions and partitions of unity {#13-dot-bump-functions-and-partitions-of-unity}


### 14. Vector fields {#14-dot-vector-fields}


## 4. Lie groups and Lie algebras {#4-dot-lie-groups-and-lie-algebras}


### 15. Lie groups {#15-dot-lie-groups}


### 16. Lie algebras {#16-dot-lie-algebras}


## 5. Differential forms {#5-dot-differential-forms}


### 17. Differential 1-Forms {#17-dot-differential-1-forms}


### 18. Differential k-Forms {#18-dot-differential-k-forms}


### 19. The exterior derivative {#19-dot-the-exterior-derivative}


### 20. The Lie derivative and interior multiplication {#20-dot-the-lie-derivative-and-interior-multiplication}


## 6. Integration {#6-dot-integration}


### 21. Orientations {#21-dot-orientations}


### 22. Manifolds with boundary {#22-dot-manifolds-with-boundary}


### 23. Integration on Manifolds {#23-dot-integration-on-manifolds}


## 7. De Rham Theory {#7-dot-de-rham-theory}


### 24. De Rham Cohomology {#24-dot-de-rham-cohomology}


### 25. The Long exact sequence in cohomology {#25-dot-the-long-exact-sequence-in-cohomology}


### 26. The Mayer-Vietoris sequence {#26-dot-the-mayer-vietoris-sequence}


### 27. Homotopy invariance {#27-dot-homotopy-invariance}


### 28. Computation of de Rham Cohomology {#28-dot-computation-of-de-rham-cohomology}


### 29. Proof of homotopy invariance {#29-dot-proof-of-homotopy-invariance}


## Appendices {#appendices}


### A. Point-Set Topology {#a-dot-point-set-topology}


### B. The inverse function theorem on \\[\mathbb{R}^n\\] and related results {#b-dot-the-inverse-function-theorem-on-mathbb-r-n-and-related-results}


### C. Existence of a partition of unity in general {#c-dot-existence-of-a-partition-of-unity-in-general}


### D. Linear algebra {#d-dot-linear-algebra}


### E. Quaternions and the symplectic group {#e-dot-quaternions-and-the-symplectic-group}
